product-api/app/controllers/api/v1/products_controller.rb

      def show
        puts "Showing products############@@@@@@@@@@@@!!!"
        render json: Product.find(params[:id]), serializer:ProductsSerializer
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

      def index
        render json: Product.all , each_serializer:ProductsSerializer
---
SELECT "products".* FROM "products"