product-api/app/controllers/products_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    logger.debug "Showing products############@@@@@@@@@@@@!!!"
    render json: Product.find(params[:id]), serializer:ProductsSerializer

INSERT INTO "products" ("name", "description", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "charger"], ["description", "This is a funky charger"], ["price", 12.0], ["created_at", "2020-05-13 05:41:23.850807"], ["updated_at", "2020-05-13 05:41:23.850807"]]
---
  def create
    @product= Product.new(product_params)
    if @product.save

SELECT "products".* FROM "products"
---
  def index
    render json: Product.all , each_serializer:ProductsSerializer

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def avatar
    @product = Product.find_by(id: params[:id])