order-api/app/controllers/orders_controller.rb

INSERT INTO "orders" ("product", "price", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["product", 1], ["price", 12000], ["user_id", 1], ["created_at", "2020-05-14 08:39:51.674818"], ["updated_at", "2020-05-14 08:39:51.674818"]]
---
  def create
    @order= Order.new(order_params)
    port = ENV.fetch("PRODUCT_PORT")
    product =  HTTParty.get("http://localhost:#{port}/products/#{order_params[:product]}")
    @order.price = ActiveSupport::JSON.decode(product.body)["price"]

    @order.user = current_user
    if @order.save